In [7]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.3

In [8]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  6  7  7  8  7
1  1  2  2  7  2
2  9  7  6  9  6
3  1  4  9  7  4
4  7  1  2  6  8

In [9]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [10]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        6        7        7        8        7
1        1        2        2        7        2
2        9        7        6        9        6
3        1        4        9        7        4
4        7        1        2        6        8

In [11]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        6        7        7        8        7
1        1        2        2        7        2
2        9        7        6        9        6
3        1        4        9        7        4
4        7        1        2        6        8

In [12]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.3

In [13]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  3  4  4  1  4
1  1  4  3  1  3
2  1  2  3  2  1
3  4  2  2  1  2
4  1  1  1  3  1
5  1  2  1  4  2
6  1  3  3  3  1
7  1  3  3  2  3
8  1  3  3  3  1
9  3  3  4  4  2

In [14]:
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
0  3  4  4  1  4
1  1  4  3  1  3
2  1  2  3  2  1
4  1  1  1  3  1
5  1  2  1  4  2
6  1  3  3  3  1
7  1  3  3  2  3
8  1  3  3  3  1
9  3  3  4  4  2

In [15]:
df[df['A'].isin([1, 3])]

   A  B  C  D  E
0  3  4  4  1  4
1  1  4  3  1  3
2  1  2  3  2  1
4  1  1  1  3  1
5  1  2  1  4  2
6  1  3  3  3  1
7  1  3  3  2  3
8  1  3  3  3  1
9  3  3  4  4  2

In [16]:
df[~df['A'].isin([1, 3])]

   A  B  C  D  E
3  4  2  2  1  2

In [17]:
import pandas as pd

print(pd.__version__)

2.3.3

In [18]:
data = {'col1':['1', '2', '3', 'teks'], 
        'col2':['1', '2', '3', '4']}

df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [19]:
df.dtypes

col1    object
col2    object
dtype: object

In [20]:
df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [21]:
df_x.dtypes

col1    object
col2     int64
dtype: object

In [22]:
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

In [24]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.3

In [26]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.date_range(start='2024-10-01', periods=n_rows, freq='h')

df = df.reset_index()
df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2024-10-01 00:00:00         14.0          1    A
1 2024-10-01 01:00:00          5.0         10    B
2 2024-10-01 02:00:00          4.0         11    C
3 2024-10-01 03:00:00          7.0         13    D
4 2024-10-01 04:00:00         19.0         15    E

In [28]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [30]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         14.0          1
1          5.0         10
2          4.0         11
3          7.0         13
4         19.0         15

In [32]:
df.select_dtypes(include='float')

   bil_pecahan
0         14.0
1          5.0
2          4.0
3          7.0
4         19.0

In [34]:
df.select_dtypes(include='int')

   bil_bulat
0          1
1         10
2         11
3         13
4         15

In [36]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [38]:
df.select_dtypes(include='datetime')

                index
0 2024-10-01 00:00:00
1 2024-10-01 01:00:00
2 2024-10-01 02:00:00
3 2024-10-01 03:00:00
4 2024-10-01 04:00:00

In [39]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0         14.0          1    A
1          5.0         10    B
2          4.0         11    C
3          7.0         13    D
4         19.0         15    E